In [25]:
import pandas as pd

In [26]:
#1
DataFrame1 = pd.DataFrame([[101,'Sakkthi',10000,1,'Junior developer'],
                          [102,'mayandi',15000,1,'Senior developer'],
                          [103,'Shalini',15000,2,'QR scan'],
                          [104,'NirmalBabu',25000,2,'manager'],
                          [105,'Vasath',10000,1,'Junior developer']])

In [27]:
DataFrame1

     0           1      2  3                 4
0  101     Sakkthi  10000  1  Junior developer
1  102     mayandi  15000  1  Senior developer
2  103     Shalini  15000  2           QR scan
3  104  NirmalBabu  25000  2           manager
4  105      Vasath  10000  1  Junior developer

In [28]:
#2
DataFrame1.columns=['Emp_no','Name','Salary','Dept_no','Designation']

In [29]:
DataFrame1

   Emp_no        Name  Salary  Dept_no       Designation
0     101     Sakkthi   10000        1  Junior developer
1     102     mayandi   15000        1  Senior developer
2     103     Shalini   15000        2           QR scan
3     104  NirmalBabu   25000        2           manager
4     105      Vasath   10000        1  Junior developer

In [30]:
DataFrame1.Salary.mean()

15000.0

In [31]:
#3 
DataFrame2 = pd.DataFrame({'deptno':[1,2,3],
                           'deptname':['Developer','Bank','Teacher'],
                           'Location':['Chennai','Bangkore','Tiruchy']})

In [32]:
DataFrame2

   deptno   deptname  Location
0       1  Developer   Chennai
1       2       Bank  Bangkore
2       3    Teacher   Tiruchy

In [46]:
#4
DataFrame3 = pd.read_csv('.\Desktop\sales.csv')

In [47]:
DataFrame3

    ID    NAME  REGION 1  REGION 2  REGION 3
0  101  Dinesh      7800    6500.0    4590.0
1  102  Mahesh      8900       NaN    3790.0
2  103  Ramesh     10800    2300.0       NaN
3  104  Suresh      5600    6790.0    2300.0
4  105   Basha      7600    2300.0    2400.0

In [35]:
#5
DataFrame3.fillna(0)

    ID    NAME  REGION 1  REGION 2  REGION 3
0  101  Dinesh      7800    6500.0    4590.0
1  102  Mahesh      8900       0.0    3790.0
2  103  Ramesh     10800    2300.0       0.0
3  104  Suresh      5600    6790.0    2300.0
4  105   Basha      7600    2300.0    2400.0

In [36]:
DataFrame3.fillna(0).mean()

C:\Users\Sakthi\AppData\Local\Temp\ipykernel_15892\3307273301.py:1: FutureWarning: The default value of numeric_only in DataFrame.mean is deprecated. In a future version, it will default to False. In addition, specifying 'numeric_only=None' is deprecated. Select only valid columns or specify the value of numeric_only to silence this warning.
  DataFrame3.fillna(0).mean()

ID           103.0
REGION 1    8140.0
REGION 2    3578.0
REGION 3    2616.0
dtype: float64

In [37]:
DataFrame3.dropna() # row drop

    ID    NAME  REGION 1  REGION 2  REGION 3
0  101  Dinesh      7800    6500.0    4590.0
3  104  Suresh      5600    6790.0    2300.0
4  105   Basha      7600    2300.0    2400.0

In [38]:
DataFrame3.dropna(axis=1) # column drop

    ID    NAME  REGION 1
0  101  Dinesh      7800
1  102  Mahesh      8900
2  103  Ramesh     10800
3  104  Suresh      5600
4  105   Basha      7600

In [39]:
DataFrame1

   Emp_no        Name  Salary  Dept_no       Designation
0     101     Sakkthi   10000        1  Junior developer
1     102     mayandi   15000        1  Senior developer
2     103     Shalini   15000        2           QR scan
3     104  NirmalBabu   25000        2           manager
4     105      Vasath   10000        1  Junior developer

In [40]:
#6
DataFrame4 = DataFrame1

In [41]:
DataFrame4.set_index('Emp_no',inplace=True)

In [42]:
DataFrame1 = DataFrame4

In [43]:
DataFrame4

              Name  Salary  Dept_no       Designation
Emp_no
101        Sakkthi   10000        1  Junior developer
102        mayandi   15000        1  Senior developer
103        Shalini   15000        2           QR scan
104     NirmalBabu   25000        2           manager
105         Vasath   10000        1  Junior developer

In [44]:
DataFrame4.iloc[2,3]

'QR scan'

In [49]:
#7
DataFrame3.set_index('ID',inplace=True)

In [51]:
DataFrame3

       NAME  REGION 1  REGION 2  REGION 3
ID
101  Dinesh      7800    6500.0    4590.0
102  Mahesh      8900       NaN    3790.0
103  Ramesh     10800    2300.0       NaN
104  Suresh      5600    6790.0    2300.0
105   Basha      7600    2300.0    2400.0

In [53]:
DataFrame3[(DataFrame3['REGION 1'] > 7000) & (DataFrame3['REGION 2'] < 3000)]

       NAME  REGION 1  REGION 2  REGION 3
ID
103  Ramesh     10800    2300.0       NaN
105   Basha      7600    2300.0    2400.0

In [54]:
DataFrame1

              Name  Salary  Dept_no       Designation
Emp_no
101        Sakkthi   10000        1  Junior developer
102        mayandi   15000        1  Senior developer
103        Shalini   15000        2           QR scan
104     NirmalBabu   25000        2           manager
105         Vasath   10000        1  Junior developer

In [55]:
#8
DataFrame1.groupby(['Name']).max()

            Salary  Dept_no       Designation
Name
NirmalBabu   25000        2           manager
Sakkthi      10000        1  Junior developer
Shalini      15000        2           QR scan
Vasath       10000        1  Junior developer
mayandi      15000        1  Senior developer

In [56]:
DataFrame3

       NAME  REGION 1  REGION 2  REGION 3
ID
101  Dinesh      7800    6500.0    4590.0
102  Mahesh      8900       NaN    3790.0
103  Ramesh     10800    2300.0       NaN
104  Suresh      5600    6790.0    2300.0
105   Basha      7600    2300.0    2400.0

In [57]:
DataFrame3.groupby(['salesman name']).max()

KeyError: 'salesman name'

In [ ]:
#9
DataFrame1['Address'] = DataFrame1.shape[0]*['Chennai']

In [ ]:
DataFrame1

In [ ]:
#10
DataFrame1 =pd.DataFrame(DataFrame1.mean())

In [ ]:
DataFrame1

In [ ]:
DataFrame1.plot()

In [ ]:
DataFrame1.plot.bar()

In [ ]:
DataFrame3 =pd.DataFrame(DataFrame1.mean())

In [ ]:
DataFrame3.plot()

In [ ]:
DataFrame3.plot.bar()